const supaUrl = "https://fzpavywwvyjfacwzgvwk.supabase.co";
const supaKey =
    "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImZ6cGF2eXd3dnlqZmFjd3pndndrIiwicm9sZSI6ImFub24iLCJpYXQiOjE2OTIzNjM2MzQsImV4cCI6MjAwNzkzOTYzNH0.VJWl8kBnMeTHq1wBjBFIt-Ax-k_6yn-DkQtsRnRAc3c";
//Pars Server
const keyApplicationId = 'LPZuJs2yZPOeycimQKgIzVmozmeXTUQa88PC0wOV';
  const keyClientKey = 'wGLrxtGyXR43lOWgcOpJPXaVXesLUR5qR6ifVFsP';
  const keyParseServerUrl = 'https://parseapi.back4app.com';
class Tabels {
  static const users = "users";
    static const donation = "donations";
     static const messages = "messages";
}

const donationsList = [
  " تبرع نقدي.",
  "تبرعات غذائية شهرية.",
  "توفير سلال غذائية."
  "تبرع بملابس جديدة أو مستعملة.",
  "تقديم بطانيات ومفروشات.",
  "تبرع بأحذية.",
  "تقديم مستلزمات صحية وأدوية.",
  "توفير أجهزة طبية مثل كراسي متحركة.",
  "تبرع بأجهزة كمبيوتر أو هواتف ذكية.",
  "تقديم دورات تدريبية مجانية.",
  "تبرعات تعليمية كالكتب والدفاتر.",
  "توفير مستلزمات مدرسية.",
  "تبرع بأدوات كهربائية ومنزلية.",
  "تقديم خدمات توعية صحية.",
  "تبرع بأدوات تنظيف ومستلزمات شخصية.",
  "توفير حملات تطعيم مجانية.",
  "تبرعات للعلاجات الطبية.",
  "تقديم دعم نفسي واجتماعي.",
  "تبرعات لدعم الأيتام.",
  "توفير مساعدات للأسر الأرملة.",
  "تبرعات للمسنين ورعايتهم.",
  "تقديم خدمات مهنية مجانية (مثل تصميم، تطوير، تسويق).",
  "تبرعات للمعوقين وتوفير مساعدات.",
  "توفير سكن مؤقت أو مأوى.",
  "تبرعات لمساعدة اللاجئين.",
  "توفير حملات طوارئ في حالات كوارث طبيعية.",
  "تبرع بوقتك كمتطوع لتقديم الخدمات.",
  "توفير وجبات إفطار أو عشاء للصائمين في شهر رمضان.",
  "تبرعات لتوفير مستلزمات الأمومة والطفولة.",
  "تقديم برامج تأهيل وتدريب لرفع مهارات الفقراء وزيادة فرصهم الوظيفية.",
  "تبرعات لدعم المشاريع الصغيرة والمشروعات الحرفية.",
  "تقديم دورات تعليمية عبر الإنترنت.",
  "تبرع بأدوات ومعدات للزراعة.",
  "توفير مواد بناء وإعمار للمنازل المتضررة.",
  "تبرعات لتوفير مصادر طاقة مستدامة.",
  "تقديم دعم لتأمين مصاريف الزواج للشباب والشابات.",
  "توفير وجبات طعام للأسر المحتاجة في المناسبات الخاصة.",
  "توفير مساعدات للأسر المتضررة من الكوارث الطبيعية.",
  "تبرعات لتوفير فرص عمل وتدريب مهني.",
  "تقديم دعم للأسر المحتاجة خلال مواسم الأعياد.",
  "تبرعات لتوفير وسائل النقل للأفراد الذين يعانون من صعوبات في التنقل.",
  "توفير مستلزمات للتخييم والرحلات للشباب من الأسر المحتاجة.",
  "تبرع بمستلزمات الأطفال الرضع (حفاضات، زجاجات، حليب).",
  "تقديم خدمات توجيه واستشارات للشباب في اختيار مساراتهم التعليمية والمهنية.",
  "تبرعات لتوفير مستلزمات الألعاب والترفيه للأطفال.",
  "توفير مواد للحفاظ على النظافة الشخصية والصحة.",
  "تبرعات لتوفير فرص تعليمية وتدريبية للشباب لتنمية مهاراتهم.",
  "تقديم دعم للأسر المحتاجة لتغطية نفقات التعليم.",
  "تبرع بمعدات رياضية وفرص لممارسة الأنشطة البدنية",
];
